//
// Description: 哈夫曼树：对于一组具有确定权值的叶子结点可以构造出多个
//              具有不同带权路径长度的二叉树，把其中最小带权路径长度的
//              二叉树称为哈夫曼树，又称最优二叉树。
// Created by hanqing zhu on 2018/11/22.
//

#ifndef CHAPTER7_UNIT8_H
#define CHAPTER7_UNIT8_H

/*------------------------------------------------------
 *
 * 哈夫曼树的结点类型定义
 *
 * author： hanqing zhu 2018/11/22 16:13
 * -----------------------------------------------------*/
typedef struct {
    //结点值
    char data;
    //权重
    double weight;
    //双亲结点
    int parent;
    //左孩子结点
    int lchild;
    //右孩子结点
    int rchild;
}HTNode;

/*------------------------------------------------------
 *
 * 哈夫曼树的构造算法
 * 
 * author： hanqing zhu 2018/11/22 16:25
 * -----------------------------------------------------*/
void createHT(HTNode ht[],int n);

#define N 50

/*------------------------------------------------------
 *
 * 结点的哈夫曼编码类型定义
 *
 * author： hanqing zhu 2018/11/22 16:43
 * -----------------------------------------------------*/
typedef struct {
    //存放当前结点的哈夫曼码
    char cd[N];
    //cd[start]~cd[n]存放哈夫曼码
    int start;
}HCode;

/*------------------------------------------------------
 *
 * 哈夫曼编码
 *
 * author： hanqing zhu 2018/11/22 16:42
 * -----------------------------------------------------*/
void createHCode(HTNode ht[],HCode hcd[],int n);





#endif //CHAPTER7_UNIT8_H
