//
// Description: 二叉树的基本运算及其实现
// Created by hanqing zhu on 2018/11/19.
//

#ifndef CHAPTER7_UNIT4_H
#define CHAPTER7_UNIT4_H


#include "btree.h"

/*------------------------------------------------------
 *
 * 创建二叉树
 *
 * author： hanqing zhu 2018/11/19 9:58
 * -----------------------------------------------------*/
void createBTNode(BTNode **b,char * str);

/*------------------------------------------------------
 *
 * 查找结点
 *
 * author： hanqing zhu 2018/11/19 10:00
 * -----------------------------------------------------*/
BTNode * FindNode(BTNode *b,ElemType x);

/*------------------------------------------------------
 *
 * 找孩子结点
 *
 * author： hanqing zhu 2018/11/19 10:02
 * -----------------------------------------------------*/
BTNode *lChildNode(BTNode *p);
BTNode * rChildNode(BTNode *p);

/*------------------------------------------------------
 *
 * 求二叉树高度
 *
 * author： hanqing zhu 2018/11/19 10:03
 * -----------------------------------------------------*/
int BTNodeHeight(BTNode *b);

/*------------------------------------------------------
 *
 * 输出二叉树
 *
 * author： hanqing zhu 2018/11/19 10:04
 * -----------------------------------------------------*/
void dispBTNode(BTNode *b);

#endif //CHAPTER7_UNIT4_H
