//
// Created by hanqing zhu on 2018/11/10.
//

#include <string.h>
#include "unit1_2.h"

//symmetry_exa3_4

/*------------------------------------------------------
* 函数名： symmetry_exa3_4
*
* 功  能：判断一个字符串是否是对称串，所谓对称串是指从左到右读和
         从右向左读的序列相同
*
* 描  述：通过栈实现
*
* 参  数：str，字符数组（字符串）
*
* 返回值：0(不是对称串)1(是对称串)
*
* 时间复杂度：
* -----------------------------------------------------*/
int symmetry_exa3_4(ElemType str[]){
    int i;
    ElemType *e;
    SqStack *s;

    initStack(&s);
    //将串所有元素进栈
    for (i = 0; str[i]!='\0' ; i++) {
        push(&s,str[i]);
    }
    for (i=0;str[i]!='\0';i++){
        //退栈元素e
        pop(&s,e);
        //若e与当前串元素不同则不是对称串
        if (str[i]!=*e){
            printf("该字符串不是对称串！");
            return 0;
        }
    }
    printf("该串是对称串！");
    return 1;
}

/*------------------------------------------------------
* 函数名：initStack
*
* 功  能：初始化栈
*
* 描  述：建立一个新的空栈s，实际上是将栈顶指针指向-1即可
*
* 参  数：S，新栈指针
*
* 返回值：无
*
* 时间复杂度：
* -----------------------------------------------------*/
void initStack(SqStack **s){
    *s=(SqStack *)malloc(sizeof(SqStack));
    (*s)->top=-1;
}

/*------------------------------------------------------
* 函数名：clearStack
*
* 功  能：销毁栈
*
* 描  述：释放栈s占用的存储空间
*
* 参  数：S，栈指针
*
* 返回值：无
*
* 时间复杂度：
* -----------------------------------------------------*/
void clearStack(SqStack **s){
    free(*s);
}

/*------------------------------------------------------
* 函数名：stackLength
*
* 功  能：求栈的长度
*
* 描  述：返回栈s中的元素个数，即栈指针加1的结果
*
* 参  数：S，栈指针
*
* 返回值：栈s中的元素个数
*
* 时间复杂度：
* -----------------------------------------------------*/
int stackLength(SqStack *s){
    return(s->top+1);
}

/*------------------------------------------------------
* 函数名：stackEmpty
*
* 功  能：判断栈是否为空
*
* 描  述：栈为空的条件是s->top==-1
*
* 参  数：S，栈指针
*
* 返回值：0(非空)或1(空)
*
* 时间复杂度：
* -----------------------------------------------------*/
int stackEmpty(SqStack *s){
    return(s->top==-1);
}

/*------------------------------------------------------
* 函数名：push
*
* 功  能：进栈
*
* 描  述：在栈不满的条件下，先将栈顶指针增1，然后在该位置上插入元素e
*
* 参  数：S，栈指针
		  e，待进栈元素
*
* 返回值：0(栈上溢出)或1(进栈成功)
*
* 时间复杂度：
* -----------------------------------------------------*/
int push(SqStack **s,ElemType e){
    if((*s)->top==MaxSize){
        return 0;
    }
    (*s)->top++;
    (*s)->data[(*s)->top]=e;
    return 1;
}

/*------------------------------------------------------
* 函数名：pop
*
* 功  能：出栈
*
* 描  述：在栈不为空的条件下，先将栈顶元素赋给e，然后将栈顶指针减1
*
* 参  数：S，栈指针
		  e，出栈元素值
*
* 返回值：0(栈下溢出)或1(进栈成功)
*
* 时间复杂度：
* -----------------------------------------------------*/
int pop(SqStack **s,ElemType *e){
    if((*s)->top==-1){
        return 0;
    }
    *e=(*s)->data[(*s)->top];
    (*s)->top--;
    return 1;
}

/*------------------------------------------------------
* 函数名：getTop
*
* 功  能：取栈顶元素
*
* 描  述：在栈不为空的条件下，将栈顶元素赋给e
*
* 参  数：S，栈指针
		  e，栈顶元素值
*
* 返回值：0(栈下溢出)或1(取值成功)
*
* 时间复杂度：
* -----------------------------------------------------*/
int getTop(SqStack **s,ElemType *e){
    if((*s)->top==-1){
        return 0;
    }
    *e=(*s)->data[(*s)->top];
    return 1;
}

/*------------------------------------------------------
* 函数名：dispStack
*
* 功  能：显示栈中元素
*
* 描  述：从栈顶到栈底顺序显示栈中所有元素
*
* 参  数：S，栈指针
*
* 返回值：无
*
* 时间复杂度：
* -----------------------------------------------------*/
void dispStack(SqStack *s) {
    int i;
    for (i = s->top; i >= 0; i--) {
        printf("%c ", s->data[i]);
    }
    printf("\n");
}
