//
// Description: 图的遍历
// Created by hanqing zhu on 2018/11/23.
//

#include "unit2.h"

#ifndef CHAPTER8_UNIT3_H
#define CHAPTER8_UNIT3_H

//在使用这些遍历算法之前，首先要调用initVisited方法进行数组的初始化
//连通图的遍历

/*------------------------------------------------------
 *
 * 深度优先搜索遍历
 * 过程：
 *      从图中某个初始顶点v出发，首先访问初始顶点v，然后选择一个
 * 与顶点v相邻且没被访问过的顶点w为初始顶点，再从w出发进行深度优
 * 先搜索，直到图中与当前顶点v邻接的所有顶点都被访问过为止。
 *
 * author： hanqing zhu 2018/11/23 10:04
 * -----------------------------------------------------*/
void DFS_AL(ALGraph *G, int v);
void DFS_MAT(MGraph g,int v);

extern int visited[MAXV];

/*------------------------------------------------------
 *
 * 初始化visited数组
 *
 * author： hanqing zhu 2018/11/23 17:00
 * -----------------------------------------------------*/
void initVisited(int *visited, int N);

/*------------------------------------------------------
 *
 * 广度优先搜索遍历
 * 过程：
 *      首先访问初始点vi，接着访问v的所有未被访问过的邻接点v1，
 * v2，...，vt，然后再按照v1，v2，...，vt的次序访问每一个顶点
 * 的所有未被访问的邻接点，以此类推，直到图中所有和初始点v有路径
 * 想通的顶点都被访问过为止。
 *
 * author： hanqing zhu 2018/11/26 10:10
 * -----------------------------------------------------*/
void BFS_AL(ALGraph *G,int v);
void BFS_MAT(MGraph g,int v);


//非连通图的遍历

/*------------------------------------------------------
 *
 * 采用深度优先搜索遍历非连通无向图
 *
 * author： hanqing zhu 2018/11/26 10:53
 * -----------------------------------------------------*/
void DFS_AL_NO(ALGraph *G);

/*------------------------------------------------------
 *
 * 采用广度优先搜索遍历非连通无向图
 * 
 * author： hanqing zhu 2018/11/26 10:54
 * -----------------------------------------------------*/
void BFS_AL_NO(ALGraph *G);


//图遍历算法的应用

/*------------------------------------------------------
 *
 * 假设图G采用邻接表存储，设计一个算法，输出图G中从顶点u到v的长
 * 度为l的所有简单路径。
 *
 * author： hanqing zhu 2018/11/26 11:06
 * -----------------------------------------------------*/
void pathAll_exa8_4(ALGraph *G,int u,int v,int l,int path[],int d);

/*------------------------------------------------------
 *
 * 假设图G采用邻接表存储，设计一个算法，求图中通过某顶点k的所有简单
 * 回路（若存在）。
 * 
 * author： hanqing zhu 2018/11/26 16:05
 * -----------------------------------------------------*/
void DFSPath_exa8_5(ALGraph *G,int u,int v,int path[],int d);

#endif //CHAPTER8_UNIT3_H
